/* Protocol Type Short Names. */

/* The key is the four-character code, the value is the short name of the protocol. */

"ftp " = "FTP";
"ftpa" = "Client-side FTP";
"http" = "HTTP";
"irc " = "IRC";
"nntp" = "NNTP";
"pop3" = "POP3";
"smtp" = "SMTP";
"sox " = "SOCKS";
"imap" = "IMAP";
"ldap" = "LDAP";
"atlk" = "AFP over AppleTalk";
"afp " = "AFP over TCP";
"teln" = "Telnet";
"ssh " = "SSH";
"ftps" = "FTP over TLS/SSL";
"htps" = "HTTP over TLS/SSL";
"htpx" = "HTTP proxy";
"htsx" = "HTTPS over TLS/SSL proxy";
"ftpx" = "FTP proxy";
"smb " = "SMB";
"rtsp" = "RTSP";
"rtsx" = "RTSP proxy";
"daap" = "DAAP";
"eppc" = "Remote Apple Events";
"ipp " = "IPP";
"ntps" = "NNTP over TLS/SSL";
"ldps" = "LDAP over TLS/SSL";
"tels" = "Telnet over TLS/SSL";
"imps" = "IMAP4 over TLS/SSL";
"ircs" = "IRC over TLS/SSL";
"pops" = "POP3 over TLS/SSL";


/* 3rd party codes. */

"AdIM" = "Adium";